betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_eth.h
/* MAC VLAN Processing APIs    ************************************************/
void              DAL_ETH_SetRxVLANIdentifier(ETH_HandleTypeDef *heth, uint32_t ComparisonBits,
                                              uint32_t VLANIdentifier);

/* MAC L2 Packet Filtering APIs  **********************************************/
DAL_StatusTypeDef DAL_ETH_GetMACFilterConfig(ETH_HandleTypeDef *heth, ETH_MACFilterConfigTypeDef *pFilterConfig);
DAL_StatusTypeDef DAL_ETH_SetMACFilterConfig(ETH_HandleTypeDef *heth, ETH_MACFilterConfigTypeDef *pFilterConfig);
DAL_StatusTypeDef DAL_ETH_SetHashTable(ETH_HandleTypeDef *heth, uint32_t *pHashTable);
DAL_StatusTypeDef DAL_ETH_SetSourceMACAddrMatch(ETH_HandleTypeDef *heth, uint32_t AddrNbr, uint8_t *pMACAddr);

/* MAC Power Down APIs    *****************************************************/
void              DAL_ETH_EnterPowerDownMode(ETH_HandleTypeDef *heth, ETH_PowerDownConfigTypeDef *pPowerDownConfig);
void              DAL_ETH_ExitPowerDownMode(ETH_HandleTypeDef *heth);
DAL_StatusTypeDef DAL_ETH_SetWakeUpFilter(ETH_HandleTypeDef *heth, uint32_t *pFilter, uint32_t Count);

/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group4
  * @{
  */
/* Peripheral State functions  **************************************************/
DAL_ETH_StateTypeDef DAL_ETH_GetState(ETH_HandleTypeDef *heth);
uint32_t             DAL_ETH_GetError(ETH_HandleTypeDef *heth);
uint32_t             DAL_ETH_GetDMAError(ETH_HandleTypeDef *heth);
uint32_t             DAL_ETH_GetMACError(ETH_HandleTypeDef *heth);
uint32_t             DAL_ETH_GetMACWakeUpSource(ETH_HandleTypeDef *heth);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ETH */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_ETH_H */


